x893/STM32H747XIH6-CD/Code/Drivers/BSP/STM32H747I_EVAL/stm32h747i_eval_lcd_ltdc.c
/**
  ******************************************************************************
  * @file    stm32h747i_eval_lcd.c
  * @author  MCD Application Team
  * @version V1.2.0
  * @date    29-December-2017
  * @brief   This file includes the driver for Liquid Crystal Display (LCD) module
  *          mounted on stm32h747I-EVAL evaluation board.
  @verbatim
  How To use this driver:
  -----------------------
   - This driver is used to drive directly an LCD TFT using the LTDC controller.
   - This driver selects dynamically the mounted LCD, AMPIRE 640x480 LCD mounted
     on MB1063 or AMPIRE 480x272 LCD mounted on MB1046 daughter board,
     and uses the adequate timing and setting for the specified LCD using
     device ID of the STMPE811 mounted on MB1046 daughter board.

  Driver description:
  ------------------
  + Initialization steps:
     o Initialize the LCD using the BSP_LCD_Init() function.
     o Apply the Layer configuration using the BSP_LCD_LayerDefaultInit() function.
     o Select the LCD layer to be used using the BSP_LCD_SelectLayer() function.
     o Enable the LCD display using the BSP_LCD_DisplayOn() function.

  + Options
     o Configure and enable the colour keying functionality using the
       BSP_LCD_SetColorKeying() function.
     o Modify in the fly the transparency and/or the frame buffer address
       using the following functions:
       - BSP_LCD_SetTransparency()
       - BSP_LCD_SetLayerAddress()

  + Display on LCD
     o Clear the whole LCD using BSP_LCD_Clear() function or only one specified string
       line using the BSP_LCD_ClearStringLine() function.
     o Display a character on the specified line and column using the BSP_LCD_DisplayChar()
       function or a complete string line using the BSP_LCD_DisplayStringAtLine() function.
     o Display a string line on the specified position (x,y in pixel) and align mode
       using the BSP_LCD_DisplayStringAtLine() function.
     o Draw and fill a basic shapes (dot, line, rectangle, circle, ellipse, .. bitmap)
       on LCD using the available set of functions.
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h747i_eval_lcd_ltdc.h"
#include "../../../Utilities/Fonts/fonts.h"
#include "../../../Utilities/Fonts/font24.c"
#include "../../../Utilities/Fonts/font20.c"
#include "../../../Utilities/Fonts/font16.c"
#include "../../../Utilities/Fonts/font12.c"
#include "../../../Utilities/Fonts/font8.c"

#include "../Components/lq035nc111/lq035nc111.h"
#include "../Components/ampire480272/ampire480272.h"
#include "../Components/ampire640480/ampire640480.h"
#include "../Components/at800480/at800480.h"
#include "../Components/lcd1024600/lcd1024600.h"
#include "../Components/ht12x21/ht12x21.h"
#include "../Components/g104age/g104age.h"

/** @defgroup LCD backligh control pin
  * @}
  */ 
#define LCD_BL_Pin 				GPIO_PIN_10
#define LCD_BL_GPIO_Port 	GPIOF

/** @addtogroup BSP
  * @{
  */

/** @addtogroup stm32h747I_EVAL
  * @{
  */

/** @addtogroup stm32h747I_EVAL_LCD
  * @{
  */

/** @defgroup stm32h747I_EVAL_LCD_Private_TypesDefinitions LCD Private TypesDefinitions
  * @{
  */
/**
  * @}
  */

/** @defgroup stm32h747I_EVAL_LCD_Private_Defines LCD Private Defines
  * @{
  */
#define POLY_X(Z)              ((int32_t)((Points + Z)->X))
#define POLY_Y(Z)              ((int32_t)((Points + Z)->Y))
/**
  * @}
  */

/** @defgroup stm32h747I_EVAL_LCD_Private_Macros LCD Private Macros
  * @{
  */
#define ABS(X)  ((X) > 0 ? (X) : -(X))
/**
  * @}
  */

/** @defgroup stm32h747I_EVAL_LCD_Private_Variables LCD Private Variables
  * @{
  */
DMA2D_HandleTypeDef hdma2d_eval;
LTDC_HandleTypeDef  hltdc_eval;
static uint32_t            PCLK_profile = LCD_MAX_PCLK;

/* Timer handler declaration */
static TIM_HandleTypeDef LCD_TimHandle;

/* Default LCD configuration with LCD Layer 1 */
static uint32_t            ActiveLayer = 0;
static LCD_DrawPropTypeDef DrawProp[MAX_LAYER_NUMBER];
/**
  * @}
  */

/** @defgroup stm32h747I_EVAL_LCD_Private_FunctionPrototypes LCD Private FunctionPrototypes
  * @{
  */
static void DrawChar(uint16_t Xpos, uint16_t Ypos, const uint8_t *c);
static void FillTriangle(uint16_t x1, uint16_t x2, uint16_t x3, uint16_t y1, uint16_t y2, uint16_t y3);
static void LL_FillBuffer(uint32_t LayerIndex, void *pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex);
static void LL_ConvertLineToARGB8888(void * pSrc, void *pDst, uint32_t xSize, uint32_t ColorMode);
//static void TIMx_PWM_MspInit(TIM_HandleTypeDef *htim);
static void TIMx_PWM_MspDeInit(TIM_HandleTypeDef *htim);
static void TIMx_PWM_DeInit(TIM_HandleTypeDef *htim);
//static void TIMx_PWM_Init(TIM_HandleTypeDef *htim);

/**
  * @}
  */

/** @addtogroup stm32h747I_EVAL_LCD_Exported_Functions
  * @{
  */

/**
  * @brief  Initializes the LCD.
  * @retval LCD state
  */
uint8_t BSP_LCD_Init(void)
{
	BSP_LCD_DeInit();
  return (BSP_LCD_InitEx(LCD_MAX_PCLK));
}

/**
  * @brief  Initializes the LCD.
  * @param  PclkConfig : pixel clock profile
  * @retval LCD state
  */
uint8_t BSP_LCD_InitEx(uint32_t PclkConfig)
{
  PCLK_profile = PclkConfig;
	
	/* Polarity */
  hltdc_eval.Init.HSPolarity = LTDC_HSPOLARITY_AL;
  hltdc_eval.Init.VSPolarity = LTDC_VSPOLARITY_AL;
  hltdc_eval.Init.DEPolarity = LTDC_DEPOLARITY_AL;
  hltdc_eval.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
  /* Select the used LCD */
#ifdef USE_320x240
	/* The LQ035NC111 LCD 320x240 is selected */
	/* Timing Configuration */    
	hltdc_eval.Init.HorizontalSync = (LQ035NC111320x240_HSYNC - 1);
	hltdc_eval.Init.VerticalSync = (LQ035NC111320x240_VSYNC - 1);
	hltdc_eval.Init.AccumulatedHBP = (LQ035NC111320x240_HSYNC + LQ035NC111320x240_HBP - 1);
	hltdc_eval.Init.AccumulatedVBP = (LQ035NC111320x240_VSYNC + LQ035NC111320x240_VBP - 1);  
	hltdc_eval.Init.AccumulatedActiveH = (LQ035NC111320x240_HEIGHT + LQ035NC111320x240_VSYNC + LQ035NC111320x240_VBP - 1);
	hltdc_eval.Init.AccumulatedActiveW = (LQ035NC111320x240_WIDTH + LQ035NC111320x240_HSYNC + LQ035NC111320x240_HBP - 1);
	hltdc_eval.Init.TotalHeigh = (LQ035NC111320x240_HEIGHT + LQ035NC111320x240_VSYNC + LQ035NC111320x240_VBP + LQ035NC111320x240_VFP - 1);
	hltdc_eval.Init.TotalWidth = (LQ035NC111320x240_WIDTH + LQ035NC111320x240_HSYNC + LQ035NC111320x240_HBP + LQ035NC111320x240_HFP - 1);

