x893/STM32H747XIH6-CD/Code/Drivers/BSP/STM32H747I_EVAL/stm32h747i_eval_lcd_ltdc.c
	hltdc_eval.LayerCfg->ImageWidth  = LQ035NC111320x240_WIDTH;
  hltdc_eval.LayerCfg->ImageHeight = LQ035NC111320x240_HEIGHT;
	
	hltdc_eval.Init.DEPolarity = LTDC_DEPOLARITY_AH; //Only 3.5 inch LCD is Hight polarity 
#endif
#ifdef USE_480x272
	/* The AMPIRE LCD 480x272 is selected */
	/* Timing Configuration */    
	hltdc_eval.Init.HorizontalSync = (AMPIRE480272_HSYNC - 1);
	hltdc_eval.Init.VerticalSync = (AMPIRE480272_VSYNC - 1);
	hltdc_eval.Init.AccumulatedHBP = (AMPIRE480272_HSYNC + AMPIRE480272_HBP - 1);
	hltdc_eval.Init.AccumulatedVBP = (AMPIRE480272_VSYNC + AMPIRE480272_VBP - 1);  
	hltdc_eval.Init.AccumulatedActiveH = (AMPIRE480272_HEIGHT + AMPIRE480272_VSYNC + AMPIRE480272_VBP - 1);
	hltdc_eval.Init.AccumulatedActiveW = (AMPIRE480272_WIDTH + AMPIRE480272_HSYNC + AMPIRE480272_HBP - 1);
	hltdc_eval.Init.TotalHeigh = (AMPIRE480272_HEIGHT + AMPIRE480272_VSYNC + AMPIRE480272_VBP + AMPIRE480272_VFP - 1);
	hltdc_eval.Init.TotalWidth = (AMPIRE480272_WIDTH + AMPIRE480272_HSYNC + AMPIRE480272_HBP + AMPIRE480272_HFP - 1);  
	
	hltdc_eval.LayerCfg->ImageWidth  = AMPIRE480272_WIDTH;
  hltdc_eval.LayerCfg->ImageHeight = AMPIRE480272_HEIGHT;
#endif
#ifdef USE_640x480
	/* Set LCD Timings */
	hltdc_eval.Init.HorizontalSync = (AMPIRE640480_HSYNC - 1);
	hltdc_eval.Init.VerticalSync = (AMPIRE640480_VSYNC - 1);
	hltdc_eval.Init.AccumulatedHBP = (AMPIRE640480_HSYNC + AMPIRE640480_HBP - 1);
	hltdc_eval.Init.AccumulatedVBP = (AMPIRE640480_VSYNC + AMPIRE640480_VBP - 1);  
	hltdc_eval.Init.AccumulatedActiveH = (AMPIRE640480_HEIGHT + AMPIRE640480_VSYNC + AMPIRE640480_VBP - 1);
	hltdc_eval.Init.AccumulatedActiveW = (AMPIRE640480_WIDTH + AMPIRE640480_HSYNC + AMPIRE640480_HBP - 1);
	hltdc_eval.Init.TotalHeigh = (AMPIRE640480_HEIGHT + AMPIRE640480_VSYNC + AMPIRE640480_VBP + AMPIRE640480_VFP - 1);
	hltdc_eval.Init.TotalWidth = (AMPIRE640480_WIDTH + AMPIRE640480_HSYNC + AMPIRE640480_HBP + AMPIRE640480_HFP - 1);

	hltdc_eval.LayerCfg->ImageWidth  = AMPIRE640480_WIDTH;
  hltdc_eval.LayerCfg->ImageHeight = AMPIRE640480_HEIGHT;
#endif
#ifdef USE_800x480
	/* The 800x480 LCD is selected */
	/* Timing Configuration */    
	hltdc_eval.Init.HorizontalSync = (AT800480_HSYNC - 1);
	hltdc_eval.Init.VerticalSync = (AT800480_VSYNC - 1);
	hltdc_eval.Init.AccumulatedHBP = (AT800480_HSYNC + AT800480_HBP - 1);
	hltdc_eval.Init.AccumulatedVBP = (AT800480_VSYNC + AT800480_VBP - 1);  
	hltdc_eval.Init.AccumulatedActiveH = (AT800480_HEIGHT + AT800480_VSYNC + AT800480_VBP - 1);
	hltdc_eval.Init.AccumulatedActiveW = (AT800480_WIDTH + AT800480_HSYNC + AT800480_HBP - 1);
	hltdc_eval.Init.TotalHeigh = (AT800480_HEIGHT + AT800480_VSYNC + AT800480_VBP + AT800480_VFP - 1);
	hltdc_eval.Init.TotalWidth = (AT800480_WIDTH + AT800480_HSYNC + AT800480_HBP + AT800480_HFP - 1);
	
	hltdc_eval.LayerCfg->ImageWidth  = AT800480_WIDTH;
  hltdc_eval.LayerCfg->ImageHeight = AT800480_HEIGHT;
#endif
#ifdef USE_800x600
	/* The 800x480 LCD is selected */
	/* Timing Configuration */    
	hltdc_eval.Init.HorizontalSync = (G104AGE_HSYNC - 1);
	hltdc_eval.Init.VerticalSync = (G104AGE_VSYNC - 1);
	hltdc_eval.Init.AccumulatedHBP = (G104AGE_HSYNC + G104AGE_HBP - 1);
	hltdc_eval.Init.AccumulatedVBP = (G104AGE_VSYNC + G104AGE_VBP - 1);  
	hltdc_eval.Init.AccumulatedActiveH = (G104AGE_HEIGHT + G104AGE_VSYNC + G104AGE_VBP - 1);
	hltdc_eval.Init.AccumulatedActiveW = (G104AGE_WIDTH + G104AGE_HSYNC + G104AGE_HBP - 1);
	hltdc_eval.Init.TotalHeigh = (G104AGE_HEIGHT + G104AGE_VSYNC + G104AGE_VBP + G104AGE_VFP - 1);
	hltdc_eval.Init.TotalWidth = (G104AGE_WIDTH + G104AGE_HSYNC + G104AGE_HBP + G104AGE_HFP - 1);
	
	hltdc_eval.LayerCfg->ImageWidth  = G104AGE_WIDTH;
  hltdc_eval.LayerCfg->ImageHeight = G104AGE_HEIGHT;
#endif
#ifdef USE_1024x600
	/* The 1024x600 LCD is selected */
	/* Timing Configuration */    
	hltdc_eval.Init.HorizontalSync = (LCD1024600_HSYNC - 1);
	hltdc_eval.Init.VerticalSync = (LCD1024600_VSYNC - 1);
	hltdc_eval.Init.AccumulatedHBP = (LCD1024600_HSYNC + LCD1024600_HBP - 1);
	hltdc_eval.Init.AccumulatedVBP = (LCD1024600_VSYNC + LCD1024600_VBP - 1);  
	hltdc_eval.Init.AccumulatedActiveH = (LCD1024600_HEIGHT + LCD1024600_VSYNC + LCD1024600_VBP - 1);
	hltdc_eval.Init.AccumulatedActiveW = (LCD1024600_WIDTH + LCD1024600_HSYNC + LCD1024600_HBP - 1);
	hltdc_eval.Init.TotalHeigh = (LCD1024600_HEIGHT + LCD1024600_VSYNC + LCD1024600_VBP + LCD1024600_VFP - 1);
	hltdc_eval.Init.TotalWidth = (LCD1024600_WIDTH + LCD1024600_HSYNC + LCD1024600_HBP + LCD1024600_HFP - 1);

	hltdc_eval.LayerCfg->ImageWidth  = LCD1024600_WIDTH;
  hltdc_eval.LayerCfg->ImageHeight = LCD1024600_HEIGHT;
#endif
#ifdef USE_1024x768
	/* The 1024x768 LCD is selected */
	/* Timing Configuration */    
	hltdc_eval.Init.HorizontalSync = (HT21X21_HSYNC - 1);
	hltdc_eval.Init.VerticalSync = (HT21X21_VSYNC - 1);
	hltdc_eval.Init.AccumulatedHBP = (HT21X21_HSYNC + HT21X21_HBP - 1);
	hltdc_eval.Init.AccumulatedVBP = (HT21X21_VSYNC + HT21X21_VBP - 1);  
	hltdc_eval.Init.AccumulatedActiveH = (HT21X21_HEIGHT + HT21X21_VSYNC + HT21X21_VBP - 1);
	hltdc_eval.Init.AccumulatedActiveW = (HT21X21_WIDTH + HT21X21_HSYNC + HT21X21_HBP - 1);
	hltdc_eval.Init.TotalHeigh = (HT21X21_HEIGHT + HT21X21_VSYNC + HT21X21_VBP + HT21X21_VFP - 1);
	hltdc_eval.Init.TotalWidth = (HT21X21_WIDTH + HT21X21_HSYNC + HT21X21_HBP + HT21X21_HFP - 1);

	hltdc_eval.LayerCfg->ImageWidth  = HT21X21_WIDTH;
  hltdc_eval.LayerCfg->ImageHeight = HT21X21_HEIGHT;
#endif

  /* Background value */
  hltdc_eval.Init.Backcolor.Blue = 0;
  hltdc_eval.Init.Backcolor.Green = 0;
  hltdc_eval.Init.Backcolor.Red = 0;

  /* Polarity */
//  hltdc_eval.Init.HSPolarity = LTDC_HSPOLARITY_AL;
//  hltdc_eval.Init.VSPolarity = LTDC_VSPOLARITY_AL;
//  hltdc_eval.Init.DEPolarity = LTDC_DEPOLARITY_AL;
//  hltdc_eval.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
  hltdc_eval.Instance = LTDC;

  /* LCD clock configuration */
  BSP_LCD_ClockConfig(&hltdc_eval, &PCLK_profile);

  if(HAL_LTDC_GetState(&hltdc_eval) == HAL_LTDC_STATE_RESET)
  {
    /* Initialize the LCD Msp: this __weak function can be rewritten by the application */
    BSP_LCD_MspInit(&hltdc_eval, NULL);
  }
  HAL_LTDC_Init(&hltdc_eval);

#if !defined(DATA_IN_ExtSDRAM)
  /* When DATA_IN_ExtSDRAM define is enabled, the SDRAM will be configured in SystemInit()
  function (from system_stm32h7xx.c) before branch to main() routine. In such case, there
  is no need to reconfigure the SDRAM within the LCD driver, since it's already initialized.
  Otherwise the SDRAM must be configured. */
  BSP_SDRAM_Init();
#endif

  /* Initialize the font */
  BSP_LCD_SetFont(&LCD_DEFAULT_FONT);

  /* Initialize TIM in PWM mode to control brightness */
//  TIMx_PWM_Init(&LCD_TimHandle);

