x893/STM32H747XIH6-CD/Code/Drivers/BSP/STM32H747I_EVAL/stm32h747i_eval_lcd_ltdc.c
//  /* TIMx Peripheral clock enable */
//  LCD_TIMx_CLK_ENABLE();

//  /* Timer channel configuration */
//  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
//  GPIO_InitStruct.Pull = GPIO_PULLUP;
//  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
//  GPIO_InitStruct.Alternate = LCD_TIMx_CHANNEL_AF;
//  GPIO_InitStruct.Pin = GPIO_PIN_6; /* BL_CTRL */

////  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
//}

/**
  * @brief  De-Initializes TIM MSP.
  * @param  htim: TIM handle
  * @retval None
  */
static void TIMx_PWM_MspDeInit(TIM_HandleTypeDef *htim)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /* TIMx Peripheral clock enable */
  LCD_TIMx_CLK_DISABLE();

  /* Timer channel configuration */
  GPIO_InitStruct.Pin = GPIO_PIN_6; /* BL_CTRL */
  HAL_GPIO_DeInit(GPIOA, GPIO_InitStruct.Pin);
}

/**
  * @brief  Initializes TIM in PWM mode
  * @param  htim: TIM handle
  * @retval None
  */
//static void TIMx_PWM_Init(TIM_HandleTypeDef *htim)
//{
  /* Timer_Clock = 2 x  APB2_clock = 200 MHz */
  /* PWM_freq = Timer_Clock /(Period x (Prescaler + 1))*/
  /* PWM_freq = 200 MHz /(50000 x 5) = 800 Hz*/

//  htim->Instance = LCD_TIMx;
//  HAL_TIM_PWM_DeInit(htim);

//  TIMx_PWM_MspInit(htim);

//  htim->Init.Prescaler         = LCD_TIMX_PRESCALER_VALUE;
//  htim->Init.Period            = LCD_TIMX_PERIOD_VALUE;
//  htim->Init.ClockDivision     = 0;
//  htim->Init.CounterMode       = TIM_COUNTERMODE_UP;
//  htim->Init.RepetitionCounter = 0;

//  HAL_TIM_PWM_Init(htim);
//}

/**
  * @brief  De-Initializes TIM in PWM mode
  * @param  htim: TIM handle
  * @retval None
  */
static void TIMx_PWM_DeInit(TIM_HandleTypeDef *htim)
{
  htim->Instance = LCD_TIMx;
  /* Timer de-intialization */
  HAL_TIM_PWM_DeInit(htim);

  /* Timer Msp de-intialization */
  TIMx_PWM_MspDeInit(htim);
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

